#!/usr/bin/env python
# -*- coding: utf-8 -*-

"""
@author: tinker
@date: 2019-01-06
"""


from wxpy import *

def wanghai(bot):
	# ---------------------------------------------------------
	# 找到好友
	# ---------------------------------------------------------
	wh = bot.friends().search("心不动则不痛", sex = MALE, city = "太原")[0]
	print(wh)

	# ---------------------------------------------------------
	# 发送文本, 图片给好友
	# ---------------------------------------------------------
	wh.send("Hello wanghai!")
	wh.send_image('E:/CR7.jpg')
	wh.send("海哥，给我发消息~")

	# ---------------------------------------------------------
	# 自动相应各类消息
	# ---------------------------------------------------------
	# 打印来自其他好友、群聊和公众号的消息
	# @bot.register()
	# def print_others(msg):
	# 	print(msg)

	# ---------------------------------------------------------
	# 回复my_friend的消息(优先匹配后注册的函数)
	# ---------------------------------------------------------
	@bot.register(wh)
	def reply_my_friend(msg):
		return 'received: {} ({})'.format(msg.text, msg.type)

	# 自动接受新的好友请求
	# @bot.register(msg_types = FRIENDS)
	# def auto_accept_friends(msg):
	# 	# 接受好友请求
	# 	new_friend = msg.card.accept()
	# 	# 向新的好友发送消息
	# 	new_friend.send("Hello, 我自动接受了你的好友请求")


def main():
	# ---------------------------------------------------------
	# 登陆wechat
	# ---------------------------------------------------------
	bot = Bot()
	# ---------------------------------------------------------
	# 保持登陆/运行
	# ---------------------------------------------------------
	# 进入python命令行、让程序保持运行
	embed()
	# 或者仅仅堵塞线程
	# bot.join()




if __name__ == "__main__":
	main()